doc/resources/benchmark_sysbench/threads32_sysbench-tpcc-noneproxy.txt
 date +%FT%TZ; \
> ./tpcc.lua --mysql-host=* --mysql-port=* --mysql-user=* --mysql-password=* \
> --mysql-db=sbt --report-interval=10 --tables=8 --scale=400 --db-driver=mysql --time=900 --threads=32 run; \
> date +%FT%TZ;
2020-04-27T06:23:25Z
sysbench 1.0.19 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 437.52 qps: 12390.44 (r/w/o: 5651.47/5851.13/887.84) lat (ms,95%): 158.63 err/s 2.40 reconn/s: 0.00
[ 20s ] thds: 32 tps: 425.21 qps: 12094.45 (r/w/o: 5515.96/5728.07/850.42) lat (ms,95%): 176.73 err/s 1.70 reconn/s: 0.00
[ 30s ] thds: 32 tps: 415.50 qps: 12097.13 (r/w/o: 5522.77/5743.37/831.00) lat (ms,95%): 186.54 err/s 1.10 reconn/s: 0.00
[ 40s ] thds: 32 tps: 430.70 qps: 12341.60 (r/w/o: 5641.84/5838.35/861.41) lat (ms,95%): 153.02 err/s 2.20 reconn/s: 0.00
[ 50s ] thds: 32 tps: 411.00 qps: 11866.84 (r/w/o: 5412.52/5632.32/822.00) lat (ms,95%): 167.44 err/s 2.20 reconn/s: 0.00
[ 60s ] thds: 32 tps: 426.60 qps: 12188.22 (r/w/o: 5567.86/5767.16/853.19) lat (ms,95%): 150.29 err/s 1.80 reconn/s: 0.00
[ 70s ] thds: 32 tps: 431.40 qps: 12207.25 (r/w/o: 5566.08/5778.38/862.80) lat (ms,95%): 150.29 err/s 1.10 reconn/s: 0.00
[ 80s ] thds: 32 tps: 414.40 qps: 11954.00 (r/w/o: 5446.10/5679.20/828.70) lat (ms,95%): 211.60 err/s 2.10 reconn/s: 0.00
[ 90s ] thds: 32 tps: 422.80 qps: 11993.12 (r/w/o: 5466.11/5681.31/845.70) lat (ms,95%): 158.63 err/s 1.60 reconn/s: 0.00
[ 100s ] thds: 32 tps: 423.60 qps: 11542.32 (r/w/o: 5255.31/5439.81/847.20) lat (ms,95%): 155.80 err/s 1.50 reconn/s: 0.00
[ 110s ] thds: 32 tps: 416.00 qps: 11704.19 (r/w/o: 5344.40/5527.80/832.00) lat (ms,95%): 158.63 err/s 1.20 reconn/s: 0.00
[ 120s ] thds: 32 tps: 417.80 qps: 12059.88 (r/w/o: 5500.39/5723.89/835.60) lat (ms,95%): 186.54 err/s 2.60 reconn/s: 0.00
[ 130s ] thds: 32 tps: 428.70 qps: 12143.19 (r/w/o: 5537.00/5748.80/857.40) lat (ms,95%): 164.45 err/s 2.00 reconn/s: 0.00
[ 140s ] thds: 32 tps: 430.70 qps: 12084.29 (r/w/o: 5513.40/5709.50/861.40) lat (ms,95%): 161.51 err/s 2.50 reconn/s: 0.00
[ 150s ] thds: 32 tps: 433.60 qps: 12328.73 (r/w/o: 5623.01/5838.51/867.20) lat (ms,95%): 155.80 err/s 2.10 reconn/s: 0.00
[ 160s ] thds: 32 tps: 421.70 qps: 11979.95 (r/w/o: 5461.88/5674.68/843.40) lat (ms,95%): 153.02 err/s 1.90 reconn/s: 0.00
[ 170s ] thds: 32 tps: 431.91 qps: 12374.96 (r/w/o: 5652.17/5858.97/863.81) lat (ms,95%): 150.29 err/s 1.80 reconn/s: 0.00
[ 180s ] thds: 32 tps: 414.30 qps: 11588.61 (r/w/o: 5284.16/5475.86/828.59) lat (ms,95%): 196.89 err/s 1.90 reconn/s: 0.00
[ 190s ] thds: 32 tps: 422.90 qps: 12009.68 (r/w/o: 5484.64/5679.24/845.81) lat (ms,95%): 153.02 err/s 1.80 reconn/s: 0.00
[ 200s ] thds: 32 tps: 440.09 qps: 12464.83 (r/w/o: 5687.42/5897.22/880.19) lat (ms,95%): 150.29 err/s 2.00 reconn/s: 0.00
[ 210s ] thds: 32 tps: 432.60 qps: 12418.04 (r/w/o: 5665.62/5887.22/865.20) lat (ms,95%): 144.97 err/s 1.50 reconn/s: 0.00
[ 220s ] thds: 32 tps: 428.60 qps: 11963.99 (r/w/o: 5453.30/5654.00/856.70) lat (ms,95%): 147.61 err/s 1.50 reconn/s: 0.00
[ 230s ] thds: 32 tps: 427.00 qps: 12242.59 (r/w/o: 5587.20/5800.90/854.50) lat (ms,95%): 155.80 err/s 1.30 reconn/s: 0.00
[ 240s ] thds: 32 tps: 423.39 qps: 11941.62 (r/w/o: 5432.52/5662.31/846.79) lat (ms,95%): 167.44 err/s 2.10 reconn/s: 0.00
[ 250s ] thds: 32 tps: 417.11 qps: 11945.64 (r/w/o: 5443.91/5667.51/834.22) lat (ms,95%): 167.44 err/s 1.30 reconn/s: 0.00
[ 260s ] thds: 32 tps: 423.20 qps: 12063.34 (r/w/o: 5498.52/5718.42/846.40) lat (ms,95%): 153.02 err/s 1.80 reconn/s: 0.00
[ 270s ] thds: 32 tps: 425.10 qps: 11924.69 (r/w/o: 5437.45/5637.05/850.19) lat (ms,95%): 150.29 err/s 1.70 reconn/s: 0.00
[ 280s ] thds: 32 tps: 422.80 qps: 12112.93 (r/w/o: 5526.41/5740.91/845.60) lat (ms,95%): 153.02 err/s 1.40 reconn/s: 0.00
[ 290s ] thds: 32 tps: 429.90 qps: 12186.06 (r/w/o: 5551.23/5775.03/859.80) lat (ms,95%): 155.80 err/s 2.30 reconn/s: 0.00
[ 300s ] thds: 32 tps: 439.20 qps: 12252.23 (r/w/o: 5593.97/5779.87/878.39) lat (ms,95%): 147.61 err/s 1.70 reconn/s: 0.00
[ 310s ] thds: 32 tps: 423.91 qps: 12140.16 (r/w/o: 5548.18/5744.18/847.81) lat (ms,95%): 150.29 err/s 2.30 reconn/s: 0.00
[ 320s ] thds: 32 tps: 428.30 qps: 12117.24 (r/w/o: 5523.27/5737.37/856.60) lat (ms,95%): 153.02 err/s 2.10 reconn/s: 0.00
[ 330s ] thds: 32 tps: 423.40 qps: 12131.79 (r/w/o: 5540.75/5744.25/846.79) lat (ms,95%): 164.45 err/s 2.00 reconn/s: 0.00
[ 340s ] thds: 32 tps: 412.80 qps: 11625.70 (r/w/o: 5309.04/5491.05/825.61) lat (ms,95%): 253.35 err/s 2.50 reconn/s: 0.00
[ 350s ] thds: 32 tps: 417.50 qps: 11967.58 (r/w/o: 5456.69/5675.89/835.00) lat (ms,95%): 200.47 err/s 2.30 reconn/s: 0.00
[ 360s ] thds: 32 tps: 426.60 qps: 12109.23 (r/w/o: 5516.87/5739.17/853.19) lat (ms,95%): 150.29 err/s 1.90 reconn/s: 0.00
[ 370s ] thds: 32 tps: 427.51 qps: 11941.54 (r/w/o: 5438.87/5647.67/855.01) lat (ms,95%): 153.02 err/s 2.00 reconn/s: 0.00
[ 380s ] thds: 32 tps: 405.59 qps: 11767.63 (r/w/o: 5361.42/5595.02/811.19) lat (ms,95%): 189.93 err/s 2.10 reconn/s: 0.00
[ 390s ] thds: 32 tps: 420.20 qps: 11963.77 (r/w/o: 5458.23/5665.43/840.10) lat (ms,95%): 153.02 err/s 2.80 reconn/s: 0.00
[ 400s ] thds: 32 tps: 404.50 qps: 11370.06 (r/w/o: 5190.98/5369.78/809.30) lat (ms,95%): 200.47 err/s 1.90 reconn/s: 0.00
[ 410s ] thds: 32 tps: 406.40 qps: 11526.30 (r/w/o: 5260.90/5452.60/812.80) lat (ms,95%): 193.38 err/s 1.80 reconn/s: 0.00
[ 420s ] thds: 32 tps: 412.40 qps: 11639.14 (r/w/o: 5303.46/5510.87/824.81) lat (ms,95%): 173.58 err/s 1.90 reconn/s: 0.00
[ 430s ] thds: 32 tps: 418.70 qps: 11805.72 (r/w/o: 5385.36/5582.96/837.39) lat (ms,95%): 170.48 err/s 1.40 reconn/s: 0.00
[ 440s ] thds: 32 tps: 413.50 qps: 11737.97 (r/w/o: 5365.33/5545.63/827.01) lat (ms,95%): 161.51 err/s 1.90 reconn/s: 0.00
[ 450s ] thds: 32 tps: 417.39 qps: 11736.92 (r/w/o: 5359.42/5542.71/834.79) lat (ms,95%): 167.44 err/s 2.00 reconn/s: 0.00
[ 460s ] thds: 32 tps: 412.20 qps: 11889.74 (r/w/o: 5422.62/5642.72/824.40) lat (ms,95%): 183.21 err/s 1.90 reconn/s: 0.00
[ 470s ] thds: 32 tps: 413.20 qps: 11906.65 (r/w/o: 5423.08/5657.18/826.40) lat (ms,95%): 176.73 err/s 1.60 reconn/s: 0.00
[ 480s ] thds: 32 tps: 419.70 qps: 11724.38 (r/w/o: 5342.04/5543.34/839.01) lat (ms,95%): 167.44 err/s 2.10 reconn/s: 0.00
[ 490s ] thds: 32 tps: 428.00 qps: 11996.22 (r/w/o: 5473.21/5666.61/856.40) lat (ms,95%): 150.29 err/s 2.20 reconn/s: 0.00
[ 500s ] thds: 32 tps: 422.80 qps: 11909.61 (r/w/o: 5435.15/5628.85/845.61) lat (ms,95%): 176.73 err/s 1.80 reconn/s: 0.00
[ 510s ] thds: 32 tps: 428.39 qps: 12148.31 (r/w/o: 5545.01/5746.51/856.79) lat (ms,95%): 158.63 err/s 1.40 reconn/s: 0.00
[ 520s ] thds: 32 tps: 417.80 qps: 11889.08 (r/w/o: 5428.69/5624.99/835.40) lat (ms,95%): 176.73 err/s 1.60 reconn/s: 0.00
[ 530s ] thds: 32 tps: 421.50 qps: 11763.52 (r/w/o: 5377.26/5543.06/843.21) lat (ms,95%): 167.44 err/s 1.10 reconn/s: 0.00
[ 540s ] thds: 32 tps: 416.90 qps: 11952.36 (r/w/o: 5446.08/5672.48/833.80) lat (ms,95%): 179.94 err/s 2.80 reconn/s: 0.00
[ 550s ] thds: 32 tps: 416.20 qps: 11873.65 (r/w/o: 5412.68/5628.58/832.40) lat (ms,95%): 170.48 err/s 1.60 reconn/s: 0.00
[ 560s ] thds: 32 tps: 440.20 qps: 12328.20 (r/w/o: 5614.50/5833.30/880.40) lat (ms,95%): 153.02 err/s 1.50 reconn/s: 0.00
[ 570s ] thds: 32 tps: 409.50 qps: 11785.73 (r/w/o: 5373.01/5593.71/819.00) lat (ms,95%): 193.38 err/s 2.50 reconn/s: 0.00
[ 580s ] thds: 32 tps: 431.60 qps: 12239.93 (r/w/o: 5573.62/5803.12/863.20) lat (ms,95%): 155.80 err/s 1.20 reconn/s: 0.00
[ 590s ] thds: 32 tps: 406.10 qps: 11704.47 (r/w/o: 5343.38/5549.98/811.10) lat (ms,95%): 173.58 err/s 1.60 reconn/s: 0.00
[ 600s ] thds: 32 tps: 410.60 qps: 11753.44 (r/w/o: 5356.92/5574.32/822.20) lat (ms,95%): 211.60 err/s 1.70 reconn/s: 0.00
[ 610s ] thds: 32 tps: 405.70 qps: 11750.96 (r/w/o: 5368.08/5571.38/811.50) lat (ms,95%): 186.54 err/s 1.80 reconn/s: 0.00
[ 620s ] thds: 32 tps: 426.90 qps: 12167.01 (r/w/o: 5548.05/5765.15/853.81) lat (ms,95%): 161.51 err/s 1.20 reconn/s: 0.00
[ 630s ] thds: 32 tps: 419.80 qps: 12092.22 (r/w/o: 5515.36/5737.26/839.59) lat (ms,95%): 176.73 err/s 2.20 reconn/s: 0.00
[ 640s ] thds: 32 tps: 420.60 qps: 11790.49 (r/w/o: 5376.60/5573.50/840.40) lat (ms,95%): 176.73 err/s 1.50 reconn/s: 0.00
[ 650s ] thds: 32 tps: 419.60 qps: 11943.17 (r/w/o: 5455.43/5647.74/840.01) lat (ms,95%): 189.93 err/s 1.70 reconn/s: 0.00
[ 660s ] thds: 32 tps: 410.90 qps: 11609.52 (r/w/o: 5297.11/5490.61/821.80) lat (ms,95%): 207.82 err/s 2.20 reconn/s: 0.00
[ 670s ] thds: 32 tps: 415.90 qps: 11893.03 (r/w/o: 5429.37/5631.87/831.80) lat (ms,95%): 173.58 err/s 1.50 reconn/s: 0.00
[ 680s ] thds: 32 tps: 420.50 qps: 11938.91 (r/w/o: 5447.31/5650.61/841.00) lat (ms,95%): 248.83 err/s 0.90 reconn/s: 0.00
[ 690s ] thds: 32 tps: 409.80 qps: 11677.44 (r/w/o: 5320.62/5537.22/819.60) lat (ms,95%): 207.82 err/s 1.40 reconn/s: 0.00
[ 700s ] thds: 32 tps: 400.20 qps: 11536.89 (r/w/o: 5258.65/5477.85/800.39) lat (ms,95%): 207.82 err/s 2.00 reconn/s: 0.00
[ 710s ] thds: 32 tps: 412.70 qps: 11669.82 (r/w/o: 5324.85/5519.56/825.41) lat (ms,95%): 176.73 err/s 1.60 reconn/s: 0.00
[ 720s ] thds: 32 tps: 410.59 qps: 11521.42 (r/w/o: 5259.52/5440.81/821.09) lat (ms,95%): 207.82 err/s 1.70 reconn/s: 0.00
[ 730s ] thds: 32 tps: 408.61 qps: 11709.35 (r/w/o: 5346.27/5545.77/817.31) lat (ms,95%): 176.73 err/s 1.90 reconn/s: 0.00
[ 740s ] thds: 32 tps: 403.80 qps: 11438.79 (r/w/o: 5211.69/5419.49/807.60) lat (ms,95%): 231.53 err/s 1.60 reconn/s: 0.00
[ 750s ] thds: 32 tps: 419.90 qps: 11801.01 (r/w/o: 5390.60/5570.60/839.80) lat (ms,95%): 183.21 err/s 1.60 reconn/s: 0.00
[ 760s ] thds: 32 tps: 411.30 qps: 11622.59 (r/w/o: 5312.90/5487.10/822.60) lat (ms,95%): 170.48 err/s 1.30 reconn/s: 0.00
[ 770s ] thds: 32 tps: 416.50 qps: 11703.08 (r/w/o: 5339.84/5530.24/832.99) lat (ms,95%): 167.44 err/s 1.80 reconn/s: 0.00
[ 780s ] thds: 32 tps: 422.30 qps: 11962.60 (r/w/o: 5452.34/5665.65/844.61) lat (ms,95%): 161.51 err/s 1.30 reconn/s: 0.00
[ 790s ] thds: 32 tps: 419.00 qps: 12034.35 (r/w/o: 5498.42/5697.92/838.00) lat (ms,95%): 158.63 err/s 1.70 reconn/s: 0.00
[ 800s ] thds: 32 tps: 410.30 qps: 11667.41 (r/w/o: 5330.00/5516.80/820.60) lat (ms,95%): 161.51 err/s 2.40 reconn/s: 0.00
[ 810s ] thds: 32 tps: 412.60 qps: 11715.31 (r/w/o: 5344.30/5545.80/825.20) lat (ms,95%): 173.58 err/s 1.40 reconn/s: 0.00
[ 820s ] thds: 32 tps: 425.19 qps: 11891.85 (r/w/o: 5414.83/5626.63/850.39) lat (ms,95%): 167.44 err/s 1.90 reconn/s: 0.00
[ 830s ] thds: 32 tps: 412.70 qps: 11548.83 (r/w/o: 5269.96/5453.46/825.41) lat (ms,95%): 211.60 err/s 1.50 reconn/s: 0.00
[ 840s ] thds: 32 tps: 421.10 qps: 11771.17 (r/w/o: 5362.08/5566.88/842.20) lat (ms,95%): 200.47 err/s 1.70 reconn/s: 0.00
[ 850s ] thds: 32 tps: 421.80 qps: 12024.24 (r/w/o: 5474.17/5706.47/843.60) lat (ms,95%): 200.47 err/s 0.40 reconn/s: 0.00
[ 860s ] thds: 32 tps: 428.20 qps: 12250.57 (r/w/o: 5597.03/5797.13/856.41) lat (ms,95%): 155.80 err/s 1.70 reconn/s: 0.00
[ 870s ] thds: 32 tps: 422.10 qps: 12099.37 (r/w/o: 5517.63/5737.53/844.21) lat (ms,95%): 193.38 err/s 2.90 reconn/s: 0.00
[ 880s ] thds: 32 tps: 401.20 qps: 11661.61 (r/w/o: 5317.00/5542.20/802.40) lat (ms,95%): 240.02 err/s 1.90 reconn/s: 0.00
[ 890s ] thds: 32 tps: 413.90 qps: 11948.82 (r/w/o: 5452.96/5668.06/827.79) lat (ms,95%): 167.44 err/s 2.30 reconn/s: 0.00
[ 900s ] thds: 32 tps: 424.70 qps: 12057.53 (r/w/o: 5494.37/5713.97/849.19) lat (ms,95%): 155.80 err/s 1.50 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            4896533
        write:                           5082018
        other:                           755902
        total:                           10734453
    transactions:                        377903 (419.79 per sec.)
    queries:                             10734453 (11924.19 per sec.)
    ignored errors:                      1621   (1.80 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          900.2237s
    total number of events:              377903

Latency (ms):
         min:                                    1.51
         avg:                                   76.21
         max:                                  726.53
         95th percentile:                      167.44
         sum:                             28801032.77

Threads fairness:
    events (avg/stddev):           11809.4688/104.40
    execution time (avg/stddev):   900.0323/0.07

2020-04-27T06:38:25Z